Revit 2024 API
ParameterTypeId.LayoutnodeCurvetypeParam Property
 "Curve Type Reference"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LayoutnodeCurvetypeParam { get; }
Visual Basic
Public Shared ReadOnly Property LayoutnodeCurvetypeParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LayoutnodeCurvetypeParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace